{
    "website_title": "Mi blog",
    "website_url": "/blog/",
    "posts": [
        
            {
                "title": "Servidor de virtualización en Raspberry Pi 4",
                "content_text": "IntroducciónHola! En este post voy a explicar como tener un servidor de virtualización en una Raspberry Pi 4, aunque estas instrucciones no son exclusivas de la Raspberry pues se puede conseguir lo mismo en cualquier Hardware que tenga instalado GNU/Linux.La utilidad de un servidor de virtualización es básicamente infinita, puedes emular cualquier Hardware ya sea para probar distintos sistemas operativos o para aislar distintos servicios. En este caso al ser un Hardware relativamente débil y con poca memoria, como lo es la Raspberry Pi 4, no será posible correr múltiples máquinas virtuales.Además del servidor de virtualización, se configurará un puente de red, esto con el objetivo de poder acceder a las máquinas virtuales desde la red local.¿Qué se necesita?  Computadora con Debian o derivada como sistema operativo y espacio suficiente para tus máquinas virtuales. (En este caso una Raspberry Pi 4, 4 GB RAM con micro sd de 64 GB).  Conexión de Ethernet para conectarte a la red.  Servidor SSH para conexión remota. (Es posible seguir la guía de forma local)Instalar lo necesarioEn primer lugar es necesario instalar un conjunto de software para virtualizar. En este caso qemu-kvmapt install qemu qemu-kvm qemu-system qemu-utils libvirt-clients libvirt-daemon-system virtinst virt-manager bridge-utilsY activamos el demonio de libvirtsystemctl enable libvirtdPuente de redAhora es necesario verificar nuestra conexión a la red, esto se puede conseguir con el comandoip aEjemplo del resultado1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000   \t\t link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\t\tinet 127.0.0.1/8 scope host lo   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 ::1/128 scope host    \t\t\tvalid_lft forever preferred_lft forever2: enp1s0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast state UP group default qlen 1000\t\tlink/ether 52:54:00:da:fd:b4 brd ff:ff:ff:ff:ff:ff\t\tinet 192.168.122.220/24 brd 192.168.122.255 scope global dynamic enp1s0   \t\t\tvalid_lft 3538sec preferred_lft 3538sec\t\tinet6 fe80::5054:ff:feda:fdb4/64 scope link    \t\t\tvalid_lft forever preferred_lft foreverDesde aquí podemos verificar que la interfaz de nuestra conexión por Ethernet tiene como nombre enp1s0 y la ip es 192.168.122.220, sabiendo esto podemos crear el puente, necesitamos entrar al archivo de configuración de interfaces. En Debian es /etc/network/interfacesvim /etc/network/interfacesDentro debemos de escribir la configuración del puente, tras modificar el archivo debe quedar así (revisa la ip, gateway y el nombre de la interfaz pues pueden no ser las mismas).# This file describes the network interfaces available on your system# and how to activate them. For more information, see interfaces(5).source /etc/network/interfaces.d/*# The loopback network interfaceauto loiface lo inet loopback# The primary network interfaceallow-hotplug enp1s0iface enp1s0 inet staticauto br0iface br0 inet static\taddress 192.168.122.220\tnetmask 255.255.255.0\tgateway 192.168.122.1\tbridge_ports enp1s0\tup /usr/sbin/brctl stp br0 onYa que estamos seguros de nuestra configuración, reiniciaremos para que estas configuraciones se apliquen. Al reiniciar podremos ver nuestra configuración algo así.1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000\t\tlink/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\t\tinet 127.0.0.1/8 scope host lo   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 ::1/128 scope host    \t\t\tvalid_lft forever preferred_lft forever2: enp1s0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast master br0 state UP group default qlen 1000\t\tlink/ether 52:54:00:da:fd:b4 brd ff:ff:ff:ff:ff:ff3: br0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP group default qlen 1000\t\tlink/ether da:64:e7:16:20:c8 brd ff:ff:ff:ff:ff:ff\t\tinet 192.168.122.220/24 brd 192.168.122.255 scope global br0   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 fe80::d864:e7ff:fe16:20c8/64 scope link    \t\t\tvalid_lft forever preferred_lft foreverComo podemos observar, ahora nuestra conexión se encuentra en la interfaz br0 que es nuestro puente.¡Listo! Ya tenemos red, ahora podemos empezar a crear nuestras máquinas virtuales.Creación de máquinas virtualesPara poder correr una máquina virtual, en primer lugar será necesario crear un disco para la máquina virtual.# Creamos el directorio para nuestros discosmkdir kvm# Creamos el disco, es posible cambiar el nombre y el tamaño del discoqemu-img create -f qcow2 ./debian.qcow2 8G# Agregamos la configuración para conectarnos con qemu mientras usemos los comandos virt-install y virshmkdir -p ~/.config/libvirt/echo 'uri_default = \"qemu:///system\"' | tee -a ~/.config/libvirt/libvirt.confYa que tenemos el disco, podemos instalar el sistema operativo.virt-install \\\t# Nombre de la máquina   \t\t--name debian \\\t# Cantidad de memoria RAM\t\t--memory 1024 \\ \t# Ubicación del disco de la máquina virtual\t\t--disk path=./debian.qcow2,size=8,format=qcow2,bus=virtio \\\t# Número de núcleos para la maquina virtual\t\t--vcpus 1 \\\t\t--os-type linux \\\t# Variante del sistema operativo\t\t--os-variant debian10 \\\t# Nombre de la interfaz de red, en este caso br0\t\t--network bridge=br0,model=virtio \\\t# Configuración sin interfaz gráfico\t\t--graphics none \\\t\t--console pty,target_type=serial \\\t# Dirección de la instalación (cambiar la arquitectura si no usas arm64)\t\t--location 'http://ftp.debian.org/debian/dists/buster/main/installer-arm64/' \\\t\t--extra-args 'console=ttyS0,115200n8 serial'Continuamos con nuestra instalación normal y ya podemos usar la máquina virtual. Puedes aprender como administrar la máquina virtual con el comandoman virshConclusiónCrear un servidor de virtualización suele sonar más complicado de lo que es, espero que esta guía te haya sido de utilidad. :)Algunas fuentesLast Dragon .(2021). Configurar Debian como servidor de virtualizacion con QEMU/KVM . Video de Youtube: https://www.youtube.com/watch?v=ADqWvmDbY0o",
                "content_html": "<h1 id=\"introducción\">Introducción</h1><p>Hola! En este post voy a explicar como tener un servidor de virtualización en una Raspberry Pi 4, aunque estas instrucciones no son exclusivas de la Raspberry pues se puede conseguir lo mismo en cualquier Hardware que tenga instalado GNU/Linux.</p><p>La utilidad de un servidor de virtualización es básicamente infinita, puedes emular cualquier Hardware ya sea para probar distintos sistemas operativos o para aislar distintos servicios. En este caso al ser un Hardware relativamente débil y con poca memoria, como lo es la Raspberry Pi 4, no será posible correr múltiples máquinas virtuales.</p><p>Además del servidor de virtualización, se configurará un puente de red, esto con el objetivo de poder acceder a las máquinas virtuales desde la red local.</p><h1 id=\"qué-se-necesita\">¿Qué se necesita?</h1><ul>  <li>Computadora con Debian o derivada como sistema operativo y espacio suficiente para tus máquinas virtuales. (En este caso una Raspberry Pi 4, 4 GB RAM con micro sd de 64 GB).</li>  <li>Conexión de Ethernet para conectarte a la red.</li>  <li>Servidor SSH para conexión remota. (Es posible seguir la guía de forma local)</li></ul><h1 id=\"instalar-lo-necesario\">Instalar lo necesario</h1><p>En primer lugar es necesario instalar un conjunto de software para virtualizar. En este caso qemu-kvm</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>apt install qemu qemu-kvm qemu-system qemu-utils libvirt-clients libvirt-daemon-system virtinst virt-manager bridge-utils</code></pre></div></div><p>Y activamos el demonio de libvirt</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>systemctl enable libvirtd</code></pre></div></div><h1 id=\"puente-de-red\">Puente de red</h1><p>Ahora es necesario verificar nuestra conexión a la red, esto se puede conseguir con el comando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>ip a</code></pre></div></div><p><strong>Ejemplo del resultado</strong></p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000   \t\t link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\t\tinet 127.0.0.1/8 scope host lo   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 ::1/128 scope host    \t\t\tvalid_lft forever preferred_lft forever2: enp1s0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast state UP group default qlen 1000\t\tlink/ether 52:54:00:da:fd:b4 brd ff:ff:ff:ff:ff:ff\t\tinet 192.168.122.220/24 brd 192.168.122.255 scope global dynamic enp1s0   \t\t\tvalid_lft 3538sec preferred_lft 3538sec\t\tinet6 fe80::5054:ff:feda:fdb4/64 scope link    \t\t\tvalid_lft forever preferred_lft forever</code></pre></div></div><p>Desde aquí podemos verificar que la interfaz de nuestra conexión por Ethernet tiene como nombre enp1s0 y la ip es 192.168.122.220, sabiendo esto podemos crear el puente, necesitamos entrar al archivo de configuración de interfaces. En Debian es /etc/network/interfaces</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>vim /etc/network/interfaces</code></pre></div></div><p>Dentro debemos de escribir la configuración del puente, tras modificar el archivo debe quedar así (revisa la ip, gateway y el nombre de la interfaz pues pueden no ser las mismas).</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code># This file describes the network interfaces available on your system# and how to activate them. For more information, see interfaces(5).source /etc/network/interfaces.d/*# The loopback network interfaceauto loiface lo inet loopback# The primary network interfaceallow-hotplug enp1s0iface enp1s0 inet staticauto br0iface br0 inet static\taddress 192.168.122.220\tnetmask 255.255.255.0\tgateway 192.168.122.1\tbridge_ports enp1s0\tup /usr/sbin/brctl stp br0 on</code></pre></div></div><p>Ya que estamos seguros de nuestra configuración, reiniciaremos para que estas configuraciones se apliquen. Al reiniciar podremos ver nuestra configuración algo así.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000\t\tlink/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\t\tinet 127.0.0.1/8 scope host lo   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 ::1/128 scope host    \t\t\tvalid_lft forever preferred_lft forever2: enp1s0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast master br0 state UP group default qlen 1000\t\tlink/ether 52:54:00:da:fd:b4 brd ff:ff:ff:ff:ff:ff3: br0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP group default qlen 1000\t\tlink/ether da:64:e7:16:20:c8 brd ff:ff:ff:ff:ff:ff\t\tinet 192.168.122.220/24 brd 192.168.122.255 scope global br0   \t\t\tvalid_lft forever preferred_lft forever\t\tinet6 fe80::d864:e7ff:fe16:20c8/64 scope link    \t\t\tvalid_lft forever preferred_lft forever</code></pre></div></div><p>Como podemos observar, ahora nuestra conexión se encuentra en la interfaz br0 que es nuestro puente.</p><p><strong>¡Listo!</strong> Ya tenemos red, ahora podemos empezar a crear nuestras máquinas virtuales.</p><h1 id=\"creación-de-máquinas-virtuales\">Creación de máquinas virtuales</h1><p>Para poder correr una máquina virtual, en primer lugar será necesario crear un disco para la máquina virtual.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code># Creamos el directorio para nuestros discosmkdir kvm# Creamos el disco, es posible cambiar el nombre y el tamaño del discoqemu-img create -f qcow2 ./debian.qcow2 8G# Agregamos la configuración para conectarnos con qemu mientras usemos los comandos virt-install y virshmkdir -p ~/.config/libvirt/echo 'uri_default = \"qemu:///system\"' | tee -a ~/.config/libvirt/libvirt.conf</code></pre></div></div><p>Ya que tenemos el disco, podemos instalar el sistema operativo.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>virt-install \\\t# Nombre de la máquina   \t\t--name debian \\\t# Cantidad de memoria RAM\t\t--memory 1024 \\ \t# Ubicación del disco de la máquina virtual\t\t--disk path=./debian.qcow2,size=8,format=qcow2,bus=virtio \\\t# Número de núcleos para la maquina virtual\t\t--vcpus 1 \\\t\t--os-type linux \\\t# Variante del sistema operativo\t\t--os-variant debian10 \\\t# Nombre de la interfaz de red, en este caso br0\t\t--network bridge=br0,model=virtio \\\t# Configuración sin interfaz gráfico\t\t--graphics none \\\t\t--console pty,target_type=serial \\\t# Dirección de la instalación (cambiar la arquitectura si no usas arm64)\t\t--location 'http://ftp.debian.org/debian/dists/buster/main/installer-arm64/' \\\t\t--extra-args 'console=ttyS0,115200n8 serial'</code></pre></div></div><p>Continuamos con nuestra instalación normal y ya podemos usar la máquina virtual. Puedes aprender como administrar la máquina virtual con el comando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>man virsh</code></pre></div></div><h1 id=\"conclusión\">Conclusión</h1><p>Crear un servidor de virtualización suele sonar más complicado de lo que es, espero que esta guía te haya sido de utilidad. :)</p><h3 id=\"algunas-fuentes\">Algunas fuentes</h3><p>Last Dragon .(2021). Configurar Debian como servidor de virtualizacion con QEMU/KVM . Video de Youtube: https://www.youtube.com/watch?v=ADqWvmDbY0o</p>",
                "url": "/blog/posts/kvm-qemu/2021/08/17/kvm-server/",
                
                
                "categories": ["kvm-qemu"],                
                
                "date_published": "2021-08-17T00:00:00+00:00",
                "date_modified": "2021-08-17T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            },
        
            {
                "title": "Usa GNU/Linux extra",
                "content_text": "El tan esperado final, lo lograste, ¿ya viste que GNU/Linux no es nada difícil? al menos a simple vista es muy sencillo y te puedo asegurar que si la mayor parte del tiempo que pasas en la computadora lo haces en un navegador de internet, no encontraras ni una sola desventaja sobre cualquier otro sistema operativo.Esta sección se va a dedicar a sugerir temas o fuentes de donde puedas aprender mas cosas o resolver problemas que te puedan surgir. La mayoría será en ingles pues es el lenguaje de internet, sin embargo siempre puedes usar un traductor en caso de no conocer el lenguaje.Temas sugeridos a investigarPrivacidadYa hiciste el paso de salir de un sistema operativo como Windows o MacOS que registran todo lo que haces, ¿por qué no intentar hacerlo en otras cosas además del sistema operativo? Puedes buscar alternativas libres para herramientas que usas diariamente, por ejemplo cambiar Whatsapp por algo como Signal que funcionan básicamente igual pero sin Facebook rastreandote. Son cosas sencillas que puedes volver un hábito. Te invito a investigar sobre el tema, algunas fuentes que te recomiendo son PrivacyGuides, Techlore.Como proteger tu computadoraYa estas en GNU/Linux, eso vuelve tu computadora un poco mas protegida pero no al 100%, necesitas aprender que cosas hacer y no hacer tanto localmente como en línea y se deben volver habito, una de ellas siendo preferir software libre, pero lo dejo a tu decisión.¿Tu propio servidor?Siii, una vez que empieces a entender un poco de Linux puedes aprender como montar servidores que al final son una computadora sin pantalla, no es difícil pero si muy interesante, tal vez puedes pensar que no te sirve de nada, pero por experiencia te puedo decir que vuelven tu vida más cómoda. Algunas cosas en las que te pueden ayudar es a automatizar dispositivos inteligentes si cuentas con ellos, bloquear anuncios de la mayor parte de internet, tu propio Netflix o Spotify privado para películas o canciones que tienes localmente, o algo más sencillo, una página web donde te presentes, el límite es tu imaginación (y tu tiempo libre jaja :])¿Cómo funciona realmente tu computadora?Siempre es interesante entender que hace tu computadora, su sistema operativo, como es que se escucha por las bocinas, como se ve por el monitor, como se conecta a internet, estas cosas no es fácil aprender en Windows o MacOS pero en Linux te encuentras a un clic de distancia de aprenderlo.Otra distribución de LinuxEn esta guía instalamos kubuntu que creo puede ser lo más sencillo para novatos, pero puedes intentar instalar cosas más complejas, al menos en maquinas virtuales. Algunas distribuciones que te pueden interesar son: Fedora y Debian que son fáciles de instalar e interesantes para experimentar, Arch que es util para entender que compone a un sistema operativo funcional o si te sientes curioso(y con tiempo libre), Gentoo que es armar el sistema operativo desde 0.Otras fuentes de informaciónLas listas no están en un orden en específico, todos son útiles o al menos interesantesPáginas webEspañol  atareao: Una página web (también podcast) muy útil para tener introducciones a algunas tecnologías usadas en Linux, desde como personalización de tu escritorio, hasta el uso de contenedores, Raspberry pi, etc.  ¡EsteBlog!: En este blog voy a subir posts sobre temas que me parecen interesantes, algunas veces simple, otras complejos, puedes visitarlo de ves en cuando para ver si hay algún post nuevo que te pueda interesarIngles  FossLinux: Guías y noticias sobre Linux en general  LinuxJourney: Un tipo de curso paso a paso para entender un poco mejor como funciona Linux.Canales de youtube:Ingles  BugsWriter: Un canal curioso pero interesante, no hay un tema en específico pero suele mostrar trucos con la terminal o compartir alguna opinión.  DistroTube: Un canal que habla sobre algunas noticias, temas interesantes o prueba distribuciones no tan comunes de Linux.  FreeCodeCamp.org: Un canal que recopila muchos tutoriales sobre tecnologías relacionadas con la computación en general.  LinusTechTips: Un canal divertido, no siempre hablan de Linux pero si sobre tecnología.  LukeSmith: Un canal con opiniones algo controversiales pero interesante de escuchar y contutoriales útiles.  NetworkChuck: Un canal con cosas interesantes pero no profundas, si algo te interesa utiliza sus videos como introducción, e investiga más por tu cuenta.  Wolgsgang: Un canal con diversos tips, tutoriales, videoblogs.Español  EraUnix: Canal principalmente enfocado en FreeBSD(Sistema Operativo Libre) pero que explica conceptos aplicados a muchos sistemas operativos.  GunnarWolf: Un profesor de Ingeniería de la UNAM que publica sus clases y alguna que otra conferencia.  LastDragon: Canal sobre Linux más enfocado a servidores y el sistema más en profundidad, cuenta con un curso de GNU/Linux.  PeladoNerd: Canal enfocado en la tecnología de contenedores, opiniones y entrevistas relacionadas con tecnología.",
                "content_html": "<p>El tan esperado final, lo lograste, ¿ya viste que GNU/Linux no es nada difícil? al menos a simple vista es muy sencillo y te puedo asegurar que si la mayor parte del tiempo que pasas en la computadora lo haces en un navegador de internet, no encontraras ni una sola desventaja sobre cualquier otro sistema operativo.</p><p>Esta sección se va a dedicar a sugerir temas o fuentes de donde puedas aprender mas cosas o resolver problemas que te puedan surgir. La mayoría será en ingles pues es el lenguaje de internet, sin embargo siempre puedes usar un <a href=\"https://libretranslate.com/\">traductor</a> en caso de no conocer el lenguaje.</p><h2 id=\"temas-sugeridos-a-investigar\">Temas sugeridos a investigar</h2><h3 id=\"privacidad\">Privacidad</h3><p>Ya hiciste el paso de salir de un sistema operativo como Windows o MacOS que registran todo lo que haces, ¿por qué no intentar hacerlo en otras cosas además del sistema operativo? Puedes buscar alternativas libres para herramientas que usas diariamente, por ejemplo cambiar Whatsapp por algo como <a href=\"https://signal.org/\">Signal</a> que funcionan básicamente igual pero sin Facebook rastreandote. Son cosas sencillas que puedes volver un hábito. Te invito a investigar sobre el tema, algunas fuentes que te recomiendo son <a href=\"https://www.privacyguides.org/\">PrivacyGuides</a>, <a href=\"https://www.youtube.com/c/Techlore\">Techlore</a>.</p><h3 id=\"como-proteger-tu-computadora\">Como proteger tu computadora</h3><p>Ya estas en GNU/Linux, eso vuelve tu computadora un poco mas protegida pero no al 100%, necesitas aprender que cosas hacer y no hacer tanto localmente como en línea y se deben volver habito, una de ellas siendo preferir software libre, pero lo dejo a tu decisión.</p><h3 id=\"tu-propio-servidor\">¿Tu propio servidor?</h3><p>Siii, una vez que empieces a entender un poco de Linux puedes aprender como montar servidores que al final son una computadora sin pantalla, no es difícil pero si muy interesante, tal vez puedes pensar que no te sirve de nada, pero por experiencia te puedo decir que vuelven tu vida más cómoda. Algunas cosas en las que te pueden ayudar es a automatizar dispositivos inteligentes si cuentas con ellos, bloquear anuncios de la mayor parte de internet, tu propio Netflix o Spotify privado para películas o canciones que tienes localmente, o algo más sencillo, una página web donde te presentes, el límite es tu imaginación (y tu tiempo libre jaja :])</p><h3 id=\"cómo-funciona-realmente-tu-computadora\">¿Cómo funciona realmente tu computadora?</h3><p>Siempre es interesante entender que hace tu computadora, su sistema operativo, como es que se escucha por las bocinas, como se ve por el monitor, como se conecta a internet, estas cosas no es fácil aprender en Windows o MacOS pero en Linux te encuentras a un clic de distancia de aprenderlo.</p><h3 id=\"otra-distribución-de-linux\">Otra distribución de Linux</h3><p>En esta guía instalamos kubuntu que creo puede ser lo más sencillo para novatos, pero puedes intentar instalar cosas más complejas, al menos en maquinas virtuales. Algunas distribuciones que te pueden interesar son: <a href=\"https://getfedora.org/es/\">Fedora</a> y <a href=\"https://www.debian.org/\">Debian</a> que son fáciles de instalar e interesantes para experimentar, <a href=\"https://archlinux.org/\">Arch</a> que es util para entender que compone a un sistema operativo funcional o si te sientes curioso(y con tiempo libre), <a href=\"https://www.gentoo.org/\">Gentoo</a> que es armar el sistema operativo desde 0.</p><h2 id=\"otras-fuentes-de-información\">Otras fuentes de información</h2><p>Las listas no están en un orden en específico, todos son útiles o al menos interesantes</p><h3 id=\"páginas-web\">Páginas web</h3><p><strong>Español</strong></p><ul>  <li><a href=\"https://atareao.es/\">atareao</a>: Una página web (también podcast) muy útil para tener introducciones a algunas tecnologías usadas en Linux, desde como personalización de tu escritorio, hasta el uso de contenedores, Raspberry pi, etc.</li>  <li><a href=\"/blog\">¡EsteBlog!</a>: En este blog voy a subir posts sobre temas que me parecen interesantes, algunas veces simple, otras complejos, puedes visitarlo de ves en cuando para ver si hay algún post nuevo que te pueda interesar</li></ul><p><strong>Ingles</strong></p><ul>  <li><a href=\"https://www.fosslinux.com/\">FossLinux</a>: Guías y noticias sobre Linux en general</li>  <li><a href=\"https://linuxjourney.com/\">LinuxJourney</a>: Un tipo de curso paso a paso para entender un poco mejor como funciona Linux.</li></ul><h3 id=\"canales-de-youtube\">Canales de youtube:</h3><p><strong>Ingles</strong></p><ul>  <li><a href=\"https://www.youtube.com/channel/UCngn7SVujlvskHRvRKc1cTw\">BugsWriter</a>: Un canal curioso pero interesante, no hay un tema en específico pero suele mostrar trucos con la terminal o compartir alguna opinión.</li>  <li><a href=\"https://www.youtube.com/channel/UCVls1GmFKf6WlTraIb_IaJg\">DistroTube</a>: Un canal que habla sobre algunas noticias, temas interesantes o prueba distribuciones no tan comunes de Linux.</li>  <li><a href=\"https://iv.caol.tk/channel/UC8butISFwT-Wl7EV0hUK0BQ\">FreeCodeCamp.org</a>: Un canal que recopila muchos tutoriales sobre tecnologías relacionadas con la computación en general.</li>  <li><a href=\"https://www.youtube.com/channel/UCXuqSBlHAE6Xw-yeJA0Tunw\">LinusTechTips</a>: Un canal divertido, no siempre hablan de Linux pero si sobre tecnología.</li>  <li><a href=\"https://www.youtube.com/channel/UC2eYFnH61tmytImy1mTYvhA\">LukeSmith</a>: Un canal con opiniones algo controversiales pero interesante de escuchar y contutoriales útiles.</li>  <li><a href=\"https://www.youtube.com/channel/UC9x0AN7BWHpCDHSm9NiJFJQ\">NetworkChuck</a>: Un canal con cosas interesantes pero no profundas, si algo te interesa utiliza sus videos como introducción, e investiga más por tu cuenta.</li>  <li><a href=\"https://www.youtube.com/channel/UCsnGwSIHyoYN0kiINAGUKxg\">Wolgsgang</a>: Un canal con diversos tips, tutoriales, videoblogs.</li></ul><p><strong>Español</strong></p><ul>  <li><a href=\"https://www.youtube.com/channel/UCvGJtQRksuhexTz_f_DkJrA\">EraUnix</a>: Canal principalmente enfocado en FreeBSD(Sistema Operativo Libre) pero que explica conceptos aplicados a muchos sistemas operativos.</li>  <li><a href=\"https://www.youtube.com/channel/UCDqXtc9GxROhLvFQ4bX6PLg\">GunnarWolf</a>: Un profesor de Ingeniería de la UNAM que publica sus clases y alguna que otra conferencia.</li>  <li><a href=\"https://www.youtube.com/channel/UCllrFdkbcxcuAdzRHj-KSMA\">LastDragon</a>: Canal sobre Linux más enfocado a servidores y el sistema más en profundidad, cuenta con un <a href=\"https://www.youtube.com/watch?v=Ue7Kw3lTdZ4\">curso</a> de GNU/Linux.</li>  <li><a href=\"https://www.youtube.com/channel/UCrBzBOMcUVV8ryyAU_c6P5g\">PeladoNerd</a>: Canal enfocado en la tecnología de contenedores, opiniones y entrevistas relacionadas con tecnología.</li></ul>",
                "url": "/blog/Usa-GNU-Linux/4",
                
                
                "categories": ["GNU-Linux"],                
                
                "date_published": "2021-08-14T00:00:00+00:00",
                "date_modified": "2021-08-14T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            },
        
            {
                "title": "Usa GNU/Linux software",
                "content_text": "En GNU/Linux la instalación y actualización del software se lleva a cabo un poco diferente, puede que estés acostumbrado a que para descargar un nuevo programa tengas que ir a una página web, descargar un ejecutable que te guiará por una serie de pasos hasta que logres instalarlo, si tienes suerte el programa buscará automáticamente por actualizaciones, pero si no, te quedaras con software desatendido.Entendamos a los administradores de paquetesEn linux se usan administradores de paquetes (programas) junto con sus repositorios. Imagínalo como una biblioteca, le pides al bibliotecario (administrador de paquetes) que te consiga un libro (paquete/programa), si está en la biblioteca te lo entregará, pero si no está te tocará conseguirlo externamente.La ventaja de tener una biblioteca(repositorio) es que sabes que los libros que están ahí están han sido revisados y autorizados por tu distribución de Linux, no contienen virus y probablemente sean de código abierto.En Debian, y sus derivadas como kubuntu, el administrador de paquetes se llama aptitude, mejor conocido simplemente como apt, tienen un funcionamiento simple de comprender, en primer lugar tiene que investigar preguntándole a los repositorios, que como ya mencionamos son como grandes almacenes de software, si existe alguna versión nueva de los paquetes instalados o se ha añadido al catálogo algún programa nuevo, en caso de que así sea, te lo hará notar. Esto se consigue con el comando      Se usa sudo pues la modificación de programas instalados solo lo puede realizar el administrador  sudo apt updateEn caso de que existan versiones nuevas del software instalado y se desee llevar a cabo la actualización, se puede llevar a cabo consudo apt upgrade¿Simple no?, si quieres buscar si existe un programa, por ejemplo, busquemos el programa neofetch, es un programa que te arroja datos básicos del equipo junto a una bonita imagen de la distribución linux, necesitamos ejecutarsudo apt search neofetch        Sorting... Done    Full Text Search... Done    neofetch/focal 7.0.0-1 all        Shows Linux System Information with Distribution LogoPuedes ver que efectivamente lo encontró, su versión y una pequeña descripción de lo que hace el programa, para instalarlo se hace consudo apt install neofetchSe imprime mucha información, entre ella:  Los paquetes que se van a instalar además del programa que deseas a estos se le llaman dependencias, muchas veces cuando alguien escribe un programa no quiere volver a escribir el código que alguien más ya escribió, por lo que mejor te hace descargar esos programas.  Los paquetes sugeridos, programas que pueden mejorar tu experiencia  Cuantos programas se actualizan, se remueven y se instalan  El peso de la descarga y el espacio que ocupará en disco.  Te pide tu autorizaciónPara seguir adelante, acepta si deseas instalarlo, y ahora prueba ejecutandoneofetch¿Bonito, no? bueno todo esto lo puedes también hacer desde un entorno gráfico, busca la tienda de aplicaciones en tu distribución, verás que es como la del teléfono, te simplifica las cosas pues desde ahí puedes instalar, actualizar y desinstalar programas, pero muchas veces hacerlo por terminal te facilita y acelera las cosas.AlternativasAlgunas veces no vas a encontrar lo que buscas en tu administrador de paquetes, en este caso tienes varias opciones, buscar a la empresa que desarrolla el programa que quieres y ver si tiene instrucciones oficiales para linux, de ser así puede que lo tenga disponible en varias opciones, las principales son:  Ejecutable: Simplemente lo corres ya sea desde la terminal o el administrador de archivos.  AppImage: A grandes rasgos es lo mismo que un ejecutable.  Repositorio externo: Algunos mantienen sus propios repositorios para poder ellos publicar su software sin restricciones, sin embargo, no lo recomiendo pues esto puede provocar fallos en tu sistema operativo a largo plazo por conflictos entre versiones de programas.  Flatpak o Snap: A grandes rasgos es como un repositorio externo, pero aislado de tu sistema, es de las formas más fáciles que tienes de instalar software, te recomiendo mucho más flatpak pues es más rápido. La desventaja es que en primer lugar tendrás que instalar ya sea flatpak o snap y posteriormente instalar tu programa además de que tendrás que actualizar tanto tu repositorio base como flatpak/snap. La ventaja es su amplia cantidad de software, por ejemplo, la tienda oficial de flatpak es flathub puedes encontrar básicamente todo lo que necesites.  Instrucciones del desarrollador: Algunas veces puedes encontrar instrucciones de como instalarlo, sin embargo recuerda tener cuidado con lo que tecleas en la terminal, en especial si usas sudo.Todas las opciones tienen sus pros y contras, siempre primero busca el software en tu repositorio con apt, pero si no tienes otra opción, las que mayormente te recomiendo es buscar ejecutables, AppImage o la versión en flatpak, pero puedes probar lo que te sea más conveniente.¡Ya casi!Has entendido lo básico sobre la administración de programas con apt y algunas alternativas, recuerda siempre estar pendiente de lo que tecleas, nadie se hace responsable más que tú.Ya casi terminas esta guía básica, pasa a la sección Extra",
                "content_html": "<p>En GNU/Linux la instalación y actualización del software se lleva a cabo un poco diferente, puede que estés acostumbrado a que para descargar un nuevo programa tengas que ir a una página web, descargar un ejecutable que te guiará por una serie de pasos hasta que logres instalarlo, si tienes suerte el programa buscará automáticamente por actualizaciones, pero si no, te quedaras con software desatendido.</p><h2 id=\"entendamos-a-los-administradores-de-paquetes\">Entendamos a los administradores de paquetes</h2><p>En linux se usan administradores de paquetes (programas) junto con sus repositorios. Imagínalo como una biblioteca, le pides al bibliotecario (administrador de paquetes) que te consiga un libro (paquete/programa), si está en la biblioteca te lo entregará, pero si no está te tocará conseguirlo externamente.</p><p>La ventaja de tener una biblioteca(repositorio) es que sabes que los libros que están ahí están han sido revisados y autorizados por tu distribución de Linux, no contienen virus y probablemente sean de código abierto.</p><p>En Debian, y sus derivadas como kubuntu, el administrador de paquetes se llama aptitude, mejor conocido simplemente como apt, tienen un funcionamiento simple de comprender, en primer lugar tiene que investigar preguntándole a los repositorios, que como ya mencionamos son como grandes almacenes de software, si existe alguna versión nueva de los paquetes instalados o se ha añadido al catálogo algún programa nuevo, en caso de que así sea, te lo hará notar. Esto se consigue con el comando</p><blockquote>  <blockquote>    <p>Se usa sudo pues la modificación de programas instalados solo lo puede realizar el administrador</p>  </blockquote></blockquote><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo apt update</code></pre></div></div><p>En caso de que existan versiones nuevas del software instalado y se desee llevar a cabo la actualización, se puede llevar a cabo con</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo apt upgrade</code></pre></div></div><p>¿Simple no?, si quieres buscar si existe un programa, por ejemplo, busquemos el programa neofetch, es un programa que te arroja datos básicos del equipo junto a una bonita imagen de la distribución linux, necesitamos ejecutar</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo apt search neofetch        Sorting... Done    Full Text Search... Done    neofetch/focal 7.0.0-1 all        Shows Linux System Information with Distribution Logo</code></pre></div></div><p>Puedes ver que efectivamente lo encontró, su versión y una pequeña descripción de lo que hace el programa, para instalarlo se hace con</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo apt install neofetch</code></pre></div></div><p>Se imprime mucha información, entre ella:</p><ul>  <li>Los paquetes que se van a instalar además del programa que deseas a estos se le llaman dependencias, muchas veces cuando alguien escribe un programa no quiere volver a escribir el código que alguien más ya escribió, por lo que mejor te hace descargar esos programas.</li>  <li>Los paquetes sugeridos, programas que pueden mejorar tu experiencia</li>  <li>Cuantos programas se actualizan, se remueven y se instalan</li>  <li>El peso de la descarga y el espacio que ocupará en disco.</li>  <li>Te pide tu autorización</li></ul><p>Para seguir adelante, acepta si deseas instalarlo, y ahora prueba ejecutando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>neofetch</code></pre></div></div><p>¿Bonito, no? bueno todo esto lo puedes también hacer desde un entorno gráfico, busca la tienda de aplicaciones en tu distribución, verás que es como la del teléfono, te simplifica las cosas pues desde ahí puedes instalar, actualizar y desinstalar programas, pero muchas veces hacerlo por terminal te facilita y acelera las cosas.</p><h2 id=\"alternativas\">Alternativas</h2><p>Algunas veces no vas a encontrar lo que buscas en tu administrador de paquetes, en este caso tienes varias opciones, buscar a la empresa que desarrolla el programa que quieres y ver si tiene instrucciones oficiales para linux, de ser así puede que lo tenga disponible en varias opciones, las principales son:</p><ul>  <li><strong>Ejecutable</strong>: Simplemente lo corres ya sea desde la terminal o el administrador de archivos.</li>  <li><strong>AppImage</strong>: A grandes rasgos es lo mismo que un ejecutable.</li>  <li><strong>Repositorio externo</strong>: Algunos mantienen sus propios repositorios para poder ellos publicar su software sin restricciones, sin embargo, no lo recomiendo pues esto puede provocar fallos en tu sistema operativo a largo plazo por conflictos entre versiones de programas.</li>  <li><strong>Flatpak o Snap</strong>: A grandes rasgos es como un repositorio externo, pero aislado de tu sistema, es de las formas más fáciles que tienes de instalar software, te recomiendo mucho más flatpak pues es más rápido. La desventaja es que en primer lugar tendrás que instalar ya sea flatpak o snap y posteriormente instalar tu programa además de que tendrás que actualizar tanto tu repositorio base como flatpak/snap. La ventaja es su amplia cantidad de software, por ejemplo, la tienda oficial de flatpak es <a href=\"https://flathub.org/home\">flathub</a> puedes encontrar básicamente todo lo que necesites.</li>  <li><strong>Instrucciones del desarrollador</strong>: Algunas veces puedes encontrar instrucciones de como instalarlo, sin embargo recuerda tener cuidado con lo que tecleas en la terminal, en especial si usas sudo.</li></ul><p>Todas las opciones tienen sus pros y contras, siempre primero busca el software en tu repositorio con <em>apt</em>, pero si no tienes otra opción, las que mayormente te recomiendo es buscar ejecutables, AppImage o la versión en flatpak, pero puedes probar lo que te sea más conveniente.</p><h2 id=\"ya-casi\">¡Ya casi!</h2><p>Has entendido lo básico sobre la administración de programas con apt y algunas alternativas, recuerda siempre estar pendiente de lo que tecleas, nadie se hace responsable más que tú.</p><p>Ya casi terminas esta guía básica, pasa a la sección <a href=\"/blog/Usa-GNU-Linux/4\">Extra</a></p>",
                "url": "/blog/Usa-GNU-Linux/3",
                
                
                "categories": ["GNU-Linux"],                
                
                "date_published": "2021-08-09T00:00:00+00:00",
                "date_modified": "2021-08-09T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            },
        
            {
                "title": "Usa GNU/Linux básico",
                "content_text": "Linux es muy parecidos a otros sistemas operativos, al menos desde la superficie, si exploraste un poco el sistema te habrás dado cuenta que se tienen herramientas en común, navegador web, calendarios, relojes, configuraciones de tu equipo, etc. Pero eso es algo que tú notaras, vamos a hablar de como manejar un poco el sistema para facilitar la comprensión de esta guía.La terminalEl uso del emulador de terminal a muchos les parece complejo, no tener botones que picar puede ser intimidante, sin embargo es algo muy sencillo una vez que le pierdes el miedo.Para acceder a ella simplemente en tu entorno de escritorio busca un programa que se llame terminal, en el caso de kde se llama konsole, al iniciarlo verás algo así:&lt;usuario&gt;@&lt;nombre_de_la_maquina&gt;:~$Esta es tu terminal, ¿simple, no?, bueno aquí puedes escribir órdenes y tu computadora las va a seguir, prueba con algo comoecho 'hola'Echo es un programa simple, imprime en la terminal lo que tú le indiques, puedes tratar con cosas más vanidosas, prueba conuname -aVerás algo de texto, algo así comoLinux debian 5.10.0-6-amd64 #1 SMP Debian 5.10.28-1 (2021-04-09) x86_64 GNU/LinuxEsto es porque el programa uname te da datos sobre el sistema, el ‘-a’ que agregamos es a lo que se le llama bandera o parámetro, son indicaciones extra para la ejecución del programa, si solo usas ‘uname’, te dirá algo así como:LinuxBueno y te preguntarás, ¿Cómo puedo saber cuáles son las banderas?, para esto se usa el comando ‘man’ y posteriormente el nombre del comando, algo así comoman uname  En caso de que te marque un error, es posible que aún no tengas instalado man, se hace con este comandosudo apt install man-db -y  Ingresas tu contraseña y listo, más adelante en la guía explicaré que significa este comandoEl comando ‘man’ hace referencia a un manual, muchos programas cuentan con manuales escritos por los desarrolladores para que se te facilite el uso de sus programas, los manuales están escritos en inglés sin embargo siempre esta disponible internet para llevar a cabo búsquedas y traducciones. Para salir simplemente tecleas la ‘q’ que hace referencia a quit (salir en inglés).Para moverte entre tus directorios (folders) puedes usar el comando  Puedes autocompletar automáticamente presionando la tecla de tabulador.cd &lt;Nombre del directorio&gt;Vamos a explorar el sistema de archivos, escribe el comandocd /Ahora estas en tu sistema raíz, es la base de todo tu sistema, ¿quieres saber que hay?, usa el comandolsEste te imprime la lista de directorios que se encuentran donde estás, verás directorios como ‘bin’ que son los binarios(programas en idioma de computadora), ‘etc’ que es donde se guardan muchas de las configuraciones, o ‘home’ que es donde se guardan los archivos de los usuarios, si quieres explorar muévete con ‘cd’ y ‘ls’, para regresar al directorio superior, puedes usarcd ..Que es uno de los llamados comodines o atajos.Existen miles de comandos que en esta guía no se usaran, sin embargo otros comandos que debes saber que están ahí, soncatQue imprime un archivo, por ejemplocat /etc/hostnameQue imprime el nombre de tu máquina.Otro importante esnanoQue es un editor de texto por terminal, muchas veces queremos editar un texto, pero sin todo el entorno gráfico, esto se logra con nano, prueba algo comonano $HOME/hola.txtQue creara un archivo en tu carpeta de usuario llamado ‘hola.txt’, y te introducirá en él para editarlo, si el archivo ya existía previamente, simplemente te introducirá a modificar el archivo, para guardar los cambios se utiliza, ‘control+o’ y para salir es con ‘control+x’, si estás creando el archivo, te permitirá cambiar el nombre, tú simplemente da ‘enter’ para aceptar.Bueno, pensarás que ya te deje un archivo que no sirve para nada, bueno para eso está el comandormCon este debes de tener extrema precaución porque no existe algo como una papelera, si usas rm se borrara tu archivo para siempre, así que ten cuidado. Para borrar el archivo que creamos, puedes usar:rm $HOME/hola.txtBueno ya que conoces los comando mas básicos, te toca explorar, la mayoria, si no es que todos, los comandos tienen un manual, recuerda siempre revisarlo, tal ves te puede ayudar.Usuario administrador o superusuarioAl igual que en otros sistemas operativos, en linux existe un usuario administrador, para ejecutar cosas como administrador se usa:sudo &lt;programa&gt;Este comando es muy poderoso, te permite ejecutar órdenes como otro usuario, en este caso como el usuario administrador, también llamado ‘root’. Algunos usos que le puedes dar es al instalar un programa o realizar modificaciones al sistema, el comando es muy útil, pero debes de tener cuidado, en muchos lugares de internet, guías o tutoriales, lo utilizan indiscriminadamente, Linux no te cuestiona lo que haces, si le dices que se borre a sí mismo, lo hará, entonces por favor, ten mucho cuidado al usar este comando, especialmente si no sabes lo que haces Nunca copies y pegues sin antes entender¡Muy bien!Has entendido lo básico de GNU/Linux, en realidad puede que nunca toques la terminal pues casi todo lo puedes hacer de manera gráfica, sin embargo es bueno que entiendas como manejarla pues es mucho más poderosa y rápida que hacer todo con clicks.Puedes dejar la guía aquí, si quieres entender un poco más, pasa a la sección Software",
                "content_html": "<p>Linux es muy parecidos a otros sistemas operativos, al menos desde la superficie, si exploraste un poco el sistema te habrás dado cuenta que se tienen herramientas en común, navegador web, calendarios, relojes, configuraciones de tu equipo, etc. Pero eso es algo que tú notaras, vamos a hablar de como manejar un poco el sistema para facilitar la comprensión de esta guía.</p><h2 id=\"la-terminal\">La terminal</h2><p>El uso del emulador de terminal a muchos les parece complejo, no tener botones que picar puede ser intimidante, sin embargo es algo muy sencillo una vez que le pierdes el miedo.</p><p>Para acceder a ella simplemente en tu entorno de escritorio busca un programa que se llame terminal, en el caso de kde se llama konsole, al iniciarlo verás algo así:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>&lt;usuario&gt;@&lt;nombre_de_la_maquina&gt;:~$</code></pre></div></div><p>Esta es tu terminal, ¿simple, no?, bueno aquí puedes escribir órdenes y tu computadora las va a seguir, prueba con algo como</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>echo 'hola'</code></pre></div></div><p>Echo es un programa simple, imprime en la terminal lo que tú le indiques, puedes tratar con cosas más vanidosas, prueba con</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>uname -a</code></pre></div></div><p>Verás algo de texto, algo así como</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>Linux debian 5.10.0-6-amd64 #1 SMP Debian 5.10.28-1 (2021-04-09) x86_64 GNU/Linux</code></pre></div></div><p>Esto es porque el programa uname te da datos sobre el sistema, el ‘-a’ que agregamos es a lo que se le llama bandera o parámetro, son indicaciones extra para la ejecución del programa, si solo usas ‘uname’, te dirá algo así como:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>Linux</code></pre></div></div><p>Bueno y te preguntarás, ¿Cómo puedo saber cuáles son las banderas?, para esto se usa el comando ‘man’ y posteriormente el nombre del comando, algo así como</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>man uname</code></pre></div></div><blockquote>  <p>En caso de que te marque un error, es posible que aún no tengas instalado man, se hace con este comando</p></blockquote><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo apt install man-db -y</code></pre></div></div><blockquote>  <p>Ingresas tu contraseña y listo, más adelante en la guía explicaré que significa este comando</p></blockquote><p>El comando ‘man’ hace referencia a un manual, muchos programas cuentan con manuales escritos por los desarrolladores para que se te facilite el uso de sus programas, los manuales están escritos en inglés sin embargo siempre esta disponible internet para llevar a cabo búsquedas y traducciones. Para salir simplemente tecleas la ‘q’ que hace referencia a quit (salir en inglés).</p><p>Para moverte entre tus directorios (folders) puedes usar el comando</p><blockquote>  <p>Puedes autocompletar automáticamente presionando la tecla de tabulador.</p></blockquote><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cd &lt;Nombre del directorio&gt;</code></pre></div></div><p>Vamos a explorar el sistema de archivos, escribe el comando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cd /</code></pre></div></div><p>Ahora estas en tu sistema raíz, es la base de todo tu sistema, ¿quieres saber que hay?, usa el comando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>ls</code></pre></div></div><p>Este te imprime la lista de directorios que se encuentran donde estás, verás directorios como ‘bin’ que son los binarios(programas en idioma de computadora), ‘etc’ que es donde se guardan muchas de las configuraciones, o ‘home’ que es donde se guardan los archivos de los usuarios, si quieres explorar muévete con ‘cd’ y ‘ls’, para regresar al directorio superior, puedes usar</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cd ..</code></pre></div></div><p>Que es uno de los llamados comodines o atajos.</p><p>Existen miles de comandos que en esta guía no se usaran, sin embargo otros comandos que debes saber que están ahí, son</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cat</code></pre></div></div><p>Que imprime un archivo, por ejemplo</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>cat /etc/hostname</code></pre></div></div><p>Que imprime el nombre de tu máquina.</p><p>Otro importante es</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>nano</code></pre></div></div><p>Que es un editor de texto por terminal, muchas veces queremos editar un texto, pero sin todo el entorno gráfico, esto se logra con nano, prueba algo como</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>nano $HOME/hola.txt</code></pre></div></div><p>Que creara un archivo en tu carpeta de usuario llamado ‘hola.txt’, y te introducirá en él para editarlo, si el archivo ya existía previamente, simplemente te introducirá a modificar el archivo, para guardar los cambios se utiliza, ‘control+o’ y para salir es con ‘control+x’, si estás creando el archivo, te permitirá cambiar el nombre, tú simplemente da ‘enter’ para aceptar.</p><p>Bueno, pensarás que ya te deje un archivo que no sirve para nada, bueno para eso está el comando</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>rm</code></pre></div></div><p>Con este debes de tener extrema precaución porque no existe algo como una papelera, si usas rm se borrara tu archivo para siempre, así que ten cuidado. Para borrar el archivo que creamos, puedes usar:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>rm $HOME/hola.txt</code></pre></div></div><p>Bueno ya que conoces los comando mas básicos, te toca explorar, la mayoria, si no es que todos, los comandos tienen un manual, recuerda siempre revisarlo, tal ves te puede ayudar.</p><h2 id=\"usuario-administrador-o-superusuario\">Usuario administrador o superusuario</h2><p>Al igual que en otros sistemas operativos, en linux existe un usuario administrador, para ejecutar cosas como administrador se usa:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>sudo &lt;programa&gt;</code></pre></div></div><p>Este comando es muy poderoso, te permite ejecutar órdenes como otro usuario, en este caso como el usuario administrador, también llamado ‘root’. Algunos usos que le puedes dar es al instalar un programa o realizar modificaciones al sistema, el comando es muy útil, pero debes de tener cuidado, en muchos lugares de internet, guías o tutoriales, lo utilizan indiscriminadamente, Linux no te cuestiona lo que haces, si le dices que se borre a sí mismo, lo hará, entonces por favor, ten mucho cuidado al usar este comando, especialmente si no sabes lo que haces <strong>Nunca copies y pegues sin antes entender</strong></p><h2 id=\"muy-bien\">¡Muy bien!</h2><p>Has entendido lo básico de GNU/Linux, en realidad puede que nunca toques la terminal pues casi todo lo puedes hacer de manera gráfica, sin embargo es bueno que entiendas como manejarla pues es mucho más poderosa y rápida que hacer todo con clicks.</p><p>Puedes dejar la guía aquí, si quieres entender un poco más, pasa a la sección <a href=\"/blog/Usa-GNU-Linux/3\">Software</a></p>",
                "url": "/blog/Usa-GNU-Linux/2",
                
                
                "categories": ["GNU-Linux"],                
                
                "date_published": "2021-08-08T00:00:00+00:00",
                "date_modified": "2021-08-08T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            },
        
            {
                "title": "Instalación de una distribución GNU/Linux",
                "content_text": "Como ya lo mencioné, una ventaja del software libre es que es gratis :) no es necesario invertir ni un solo peso para seguir esta guía, teniendo en mente que ya cuentas con el Hardware. Considero que la mejor forma de empezar es probar una distribución de GNU/Linux por tu propia cuenta, en caso de que ya tengas la instalación, puedes pasar al nivel Básico sin problemas, esta guía estará basada en kubuntu, un ubuntu con kde, pero si tienes otra distribución, solo cambia el gestor de paquetes.En caso de que no desees instalar nada puedes no llevar a cabo la instalación y simplemente arrancar el sistema desde la usb sin afectar tu instalación de windows. Es posible llegar a  dentro del escritorio sin afectar tu instalación de windows y continuar esta guía con el método de arranque de la usb para ver si el sistema te convence, solamente recuerda que lo que hagas se borrará al apagar la computadora.RequerimientosPara probar GNU/Linux necesitarás una computadora y una memoria USB (Sin información) de al menos 4gb. En esta guía instalaremos kubuntu, es una variante de Ubuntu (la distribución más popular entre principiantes) que contiene el entorno de escritorio KDE, esto facilitara que te acostumbres viniendo de windows, si tú después decides que quieres probar otra distribución, algunas sugerencias son Fedora que es fantastica para probar las tecnologías nuevas Debian la mejor distribución si valoras estabilidad sobre novedad o Arch si quieres el software más nuevo.Bueno primero que nada necesitamos descargar dos cosas, ventoy y la iso(imagen) de kubuntu.Ventoy  Dirígete a la página de descargas y busca el ventoy-windows.zip más reciente y descárgalo.  Ve a la carpeta y con clic derecho descomprímelo y accede a la carpeta descomprimida. (si no puedes descomprimir, puedes usar el programa 7zip)  Ejecuta Ventoy2Disk.exe (no es necesario que te aparezca la extensión .exe) te pedirá permisos de administrador.  Verás a tu memoria en el apartado de Device, asegúrate que es la correcta de lo contrario podrías formatear el dispositivo incorrecto, da click en install.  Te indicará dos advertencias que tendrás que aceptar  ¡listo! tu memoria usb ahora es un dispositivo desde el que se puede arrancar una gran variedad de sistemas operativos.KubuntuAhora toca descargar kubuntu.Descarga el más reciente para evitar problemas de compatibilidadEn caso de que tengas una computadora con recursos bajos, puedes probar xubuntu o si tienes curiosidad, probar con otras variaciones de ubuntu , las puedes ver aquí pero si al final te decides quedar con Linux, te recomiendo cambiar a sistemas como Debian o Fedora.Sin importar el que escojas, descárgalo dentro de tu memoria formateada con ventoy y al terminar, apaga la computadora.Secure bootDesafortunadamente muchos fabricantes bloquean las opciones de arranque de las computadoras, tendrás que buscar en internet como acceder al bios de tu fabricante en específico, algunas teclas comunes son:* ASRock: F2 or DEL* ASUS: F2 for all PCs, F2 or DEL* Acer: F2 or DEL* Dell: F2 or F12* ECS: DEL* Gigabyte / Aorus: F2 or DEL* HP: F10* Lenovo (Laptops): F2 or Fn + F2* Lenovo (Escritorio): F1* Lenovo (ThinkPads): Enter then F1.* MSI: DEL* Microsoft Surface Tablets: Manten presionado el boton de subir volumen* Origin PC: F2* Samsung: F2* Toshiba: F2* Zotac: DELYa dentro del menú de bios buscarás en el apartado de boot/arranque o de security/seguridad alguna opción que menciona al secure boot o arranque seguro y lo tendrás que desactivar, esto es para evitar errores al correr desde la usb.Ya que lo desactivaste solo guardas y apagas la computadora, en caso de que te metas a Windows, apagas desde el menú de inicio de sesión.Arranque desde la USBAl arrancar tu computadora pulsarás un botón de selector de arranque, de nuevo, esto varía entre fabricantes aunque comúnmente esta tecla es F10, F11, F12 o Esc, intentas con estas o buscas la especifica de tu computadora y te dejará escoger desde que dispositivo arrancar, obviamente arrancaras desde la usb.Dejarás que kubuntu arranque hasta que te presente un menú, en este te dará varias opciones, selecciona kubuntu.Puedes cambiar el idioma y pulsa probar kubuntuDentro del escritorioAhora estás dentro del sistema linux, explóralo, métete a internet (firefox es el navegador incluido) escribe documentos de texto, explora la configuración (a decir verdad debian es un poco feo por default) solo recuerda que al apagar la computadora todos los cambios que hagas en el sistema se borrarán (cosas que descargues de internet, documentos que escribas, etc.).Debes de probar la mayor parte de tu hardware, cámara, micrófono, tarjeta wifi. etc. si todo funciona por si solo, ¡Felicidades! tu computadora corre linux perfectamente, en el caso contrario tendrás que investigar que es lo que no te funciona e intentar solucionarlo.InstalaciónSi ya estás seguro de querer instalar linux tienes dos opciones, la primera es hacer un “dual boot” que significa tener tanto windows como linux en una misma computadora con un pequeño menú al arrancar para escoger uno ,obviamente al compartir el mismo disco tendrás que reducir el espacio de la partición de windows, la segunda es simplemente borrar tu disco y usar solamente linux. Ambos casos se presentarán en esta guía, sin embargo es absolutamente recomendable que hagas un respaldo de toda la información que contenga la computadora antes de proceder desde este punto.Preparación DualbootPara iniciar este proceso tenemos que arrancar con windows, con una cuenta con privilegios de administrador accederemos al programa llamado “administrador de particiones o de discos”Una vez dentro verás en la parte de abajo el disco 0 con mínimo 3 particiones, la más grande se marcará como tu disco c y este será al que reduciremos en espacio. Da un click derecho en la partición y elige reducir volumen o shrink volume, debes de escoger cuanto vas a reducir el espacio, lo mínimo para un entorno gráfico son 10 GB, pero si le piensas dar un uso relativamente frecuente, un mínimo de 30 GB es lo que yo te recomiendo, recuerda que en la opción de cuanto espacio lo quieres reducir te lo pide en MB así que si son 30 GB tendrás que escribir 30720.Una vez con ese espacio libre, el disco se verá asíObserva el espacio negro, ese es el espacio que quedará para linux, ya puedes apagar windows.InstalaciónRecuerda tener tu disco respaldado incluso si quieres hacer un dualboot pues se modificaran particiones.  La instalación de linux se divide en varias partes, pero en un inicio volverás a arrancar desde la usb aunque esta vez seleccionarás instalar kubuntu.  Escoge tu distribución de teclado, normalmente será latinoamericano o español.  Escoge las aplicaciones, te recomiendo una instalación mínima pues será más ligera, pero si deseas tener múltiple software desde la instalación, escoge la normal. Selecciona ambas opciones extra, la primera es para tener un sistema actualizado desde el inicio y la segunda para instalar drivers y formatos no libres, esto facilitará tu experiencia.  Selecciona tu disco, si tu computadora tiene múltiples discos, escoge donde lo deseas instalar. En caso de que hayas llevado a cabo los pasos para el Dualboot, verás la opción de instalar junto a Windows 10.Si ves todo correcto, das aceptar.  Escoge tu localización, esto es para la zona horaria.  Crea tu usuario, recuerda usar una contraseña fuerte.  Empieza la instalación y espera a que termine y reinicias.¡Felicidades!Con tu sistema listo toca llevar a cabo una capacitación básica de su uso, pasa con gusto a la sección Básico.",
                "content_html": "<p>Como ya lo mencioné, una ventaja del software libre es que es gratis :) no es necesario invertir ni un solo peso para seguir esta guía, teniendo en mente que ya cuentas con el Hardware. Considero que la mejor forma de empezar es probar una distribución de GNU/Linux por tu propia cuenta, en caso de que ya tengas la instalación, puedes pasar al nivel <a href=\"/blog/Usa-GNU-Linux/2\">Básico</a> sin problemas, esta guía estará basada en kubuntu, un ubuntu con kde, pero si tienes otra distribución, solo cambia el gestor de paquetes.</p><p>En caso de que no desees instalar nada puedes no llevar a cabo la instalación y simplemente arrancar el sistema desde la usb sin afectar tu instalación de windows. Es posible llegar a  dentro del escritorio sin afectar tu instalación de windows y continuar esta guía con el método de arranque de la usb para ver si el sistema te convence, solamente recuerda que lo que hagas se borrará al apagar la computadora.</p><h2 id=\"requerimientos\">Requerimientos</h2><p>Para probar GNU/Linux necesitarás una computadora y una memoria USB (Sin información) de al menos 4gb. En esta guía instalaremos kubuntu, es una variante de Ubuntu (la distribución más popular entre principiantes) que contiene el entorno de escritorio KDE, esto facilitara que te acostumbres viniendo de windows, si tú después decides que quieres probar otra distribución, algunas sugerencias son <a href=\"https://getfedora.org/es/\">Fedora</a> que es fantastica para probar las tecnologías nuevas <a href=\"https://www.debian.org/\">Debian</a> la mejor distribución si valoras estabilidad sobre novedad o <a href=\"https://archlinux.org/\">Arch</a> si quieres el software más nuevo.</p><p>Bueno primero que nada necesitamos descargar dos cosas, <a href=\"https://ventoy.net/en/index.html\">ventoy</a> y la iso(imagen) de <a href=\"https://kubuntu.org/getkubuntu/\">kubuntu</a>.</p><h4 id=\"ventoy\">Ventoy</h4><ol>  <li>Dirígete a la página de <a href=\"https://github.com/ventoy/Ventoy/releases\">descargas</a> y busca el ventoy-windows.zip más reciente y descárgalo.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-01.png\" alt=\"\" /></p><ol>  <li>Ve a la carpeta y con clic derecho descomprímelo y accede a la carpeta descomprimida. (si no puedes descomprimir, puedes usar el programa <a href=\"https://7-zip.org/\">7zip</a>)</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-02.jpg\" alt=\"\" /></p><ol>  <li>Ejecuta Ventoy2Disk.exe (no es necesario que te aparezca la extensión .exe) te pedirá permisos de administrador.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-03.jpg\" alt=\"\" /></p><ol>  <li>Verás a tu memoria en el apartado de Device, asegúrate que es la correcta de lo contrario podrías formatear el dispositivo incorrecto, da click en install.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-04.jpg\" alt=\"\" /></p><ol>  <li>Te indicará dos advertencias que tendrás que aceptar</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-05.jpg\" alt=\"\" /><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-06.jpg\" alt=\"\" /></p><ol>  <li>¡listo! tu memoria usb ahora es un dispositivo desde el que se puede arrancar una gran variedad de sistemas operativos.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/ventoy-07.jpg\" alt=\"\" /></p><h4 id=\"kubuntu\">Kubuntu</h4><p>Ahora toca descargar <a href=\"https://kubuntu.org/getkubuntu/\">kubuntu</a>.</p><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-page.png\" alt=\"\" /></p><p><strong>Descarga el más reciente para evitar problemas de compatibilidad</strong></p><p>En caso de que tengas una computadora con recursos bajos, puedes probar <a href=\"https://xubuntu.org/\">xubuntu</a> o si tienes curiosidad, probar con otras variaciones de ubuntu , las puedes ver <a href=\"https://ubuntu.com/download/flavours\">aquí</a> pero si al final te decides quedar con Linux, te recomiendo cambiar a sistemas como Debian o Fedora.</p><p>Sin importar el que escojas, descárgalo dentro de tu memoria formateada con ventoy y al terminar, apaga la computadora.</p><h2 id=\"secure-boot\">Secure boot</h2><p>Desafortunadamente muchos fabricantes bloquean las opciones de arranque de las computadoras, tendrás que buscar en internet como acceder al bios de tu fabricante en específico, algunas teclas comunes son:</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>* ASRock: F2 or DEL* ASUS: F2 for all PCs, F2 or DEL* Acer: F2 or DEL* Dell: F2 or F12* ECS: DEL* Gigabyte / Aorus: F2 or DEL* HP: F10* Lenovo (Laptops): F2 or Fn + F2* Lenovo (Escritorio): F1* Lenovo (ThinkPads): Enter then F1.* MSI: DEL* Microsoft Surface Tablets: Manten presionado el boton de subir volumen* Origin PC: F2* Samsung: F2* Toshiba: F2* Zotac: DEL</code></pre></div></div><p>Ya dentro del menú de bios buscarás en el apartado de boot/arranque o de security/seguridad alguna opción que menciona al secure boot o arranque seguro y lo tendrás que desactivar, esto es para evitar errores al correr desde la usb.</p><p><img src=\"/blog/assets/pictures/GNU-Linux/secure-boot.jpg\" alt=\"\" /></p><p>Ya que lo desactivaste solo guardas y apagas la computadora, en caso de que te metas a Windows, apagas desde el menú de inicio de sesión.</p><h2 id=\"arranque-desde-la-usb\">Arranque desde la USB</h2><p>Al arrancar tu computadora pulsarás un botón de selector de arranque, de nuevo, esto varía entre fabricantes aunque comúnmente esta tecla es F10, F11, F12 o Esc, intentas con estas o buscas la especifica de tu computadora y te dejará escoger desde que dispositivo arrancar, obviamente arrancaras desde la usb.</p><p>Dejarás que kubuntu arranque hasta que te presente un menú, en este te dará varias opciones, selecciona kubuntu.</p><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-boot.png\" alt=\"\" /></p><p>Puedes cambiar el idioma y pulsa probar kubuntu</p><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-try.png\" alt=\"\" /></p><h2 id=\"dentro-del-escritorio\">Dentro del escritorio</h2><p>Ahora estás dentro del sistema linux, explóralo, métete a internet (firefox es el navegador incluido) escribe documentos de texto, explora la configuración (a decir verdad debian es un poco feo por default) solo recuerda que al apagar la computadora todos los cambios que hagas en el sistema se borrarán (cosas que descargues de internet, documentos que escribas, etc.).</p><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-desktop1.png\" alt=\"\" /></p><p>Debes de probar la mayor parte de tu hardware, cámara, micrófono, tarjeta wifi. etc. si todo funciona por si solo, ¡Felicidades! tu computadora corre linux perfectamente, en el caso contrario tendrás que investigar que es lo que no te funciona e intentar solucionarlo.</p><h2 id=\"instalación\">Instalación</h2><p>Si ya estás seguro de querer instalar linux tienes dos opciones, la primera es hacer un “dual boot” que significa tener tanto windows como linux en una misma computadora con un pequeño menú al arrancar para escoger uno ,obviamente al compartir el mismo disco tendrás que reducir el espacio de la partición de windows, la segunda es simplemente borrar tu disco y usar solamente linux. Ambos casos se presentarán en esta guía, sin embargo es absolutamente recomendable que hagas un respaldo de toda la información que contenga la computadora antes de proceder desde este punto.</p><h4 id=\"preparación-dualboot\">Preparación Dualboot</h4><p>Para iniciar este proceso tenemos que arrancar con windows, con una cuenta con privilegios de administrador accederemos al programa llamado “administrador de particiones o de discos”</p><p><img src=\"/blog/assets/pictures/GNU-Linux/win-part.png\" alt=\"\" /></p><p>Una vez dentro verás en la parte de abajo el disco 0 con mínimo 3 particiones, la más grande se marcará como tu disco c y este será al que reduciremos en espacio. Da un click derecho en la partición y elige reducir volumen o shrink volume, debes de escoger cuanto vas a reducir el espacio, lo mínimo para un entorno gráfico son 10 GB, pero si le piensas dar un uso relativamente frecuente, un mínimo de 30 GB es lo que yo te recomiendo, recuerda que en la opción de cuanto espacio lo quieres reducir te lo pide en MB así que si son 30 GB tendrás que escribir 30720.</p><p><img src=\"/blog/assets/pictures/GNU-Linux/win-part2.jpg\" alt=\"\" /></p><p>Una vez con ese espacio libre, el disco se verá así</p><p><img src=\"https://www.linuxtechi.com/wp-content/uploads/2019/10/Unallocated-partition.jpg\" alt=\"\" /></p><p>Observa el espacio negro, ese es el espacio que quedará para linux, ya puedes apagar windows.</p><h4 id=\"instalación-1\">Instalación</h4><p>Recuerda tener tu disco respaldado incluso si quieres hacer un dualboot pues se modificaran particiones.  La instalación de linux se divide en varias partes, pero en un inicio volverás a arrancar desde la usb aunque esta vez seleccionarás instalar kubuntu.</p><ol>  <li>Escoge tu distribución de teclado, normalmente será latinoamericano o español.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-keyboard.png\" alt=\"\" /></p><ol>  <li>Escoge las aplicaciones, te recomiendo una instalación mínima pues será más ligera, pero si deseas tener múltiple software desde la instalación, escoge la normal. Selecciona ambas opciones extra, la primera es para tener un sistema actualizado desde el inicio y la segunda para instalar drivers y formatos no libres, esto facilitará tu experiencia.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-minimal.png\" alt=\"\" /></p><ol>  <li>Selecciona tu disco, si tu computadora tiene múltiples discos, escoge donde lo deseas instalar. En caso de que hayas llevado a cabo los pasos para el Dualboot, verás la opción de instalar junto a Windows 10.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-disk.png\" alt=\"\" /></p><p>Si ves todo correcto, das aceptar.</p><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-disk2.png\" alt=\"\" /></p><ol>  <li>Escoge tu localización, esto es para la zona horaria.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-timezone.png\" alt=\"\" /></p><ol>  <li>Crea tu usuario, recuerda usar una contraseña fuerte.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-user.png\" alt=\"\" /></p><ol>  <li>Empieza la instalación y espera a que termine y reinicias.</li></ol><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-end.png\" alt=\"\" /></p><h2 id=\"felicidades\">¡Felicidades!</h2><p><img src=\"/blog/assets/pictures/GNU-Linux/kubuntu-login.png\" alt=\"\" /></p><p>Con tu sistema listo toca llevar a cabo una capacitación básica de su uso, pasa con gusto a la sección <a href=\"/blog/Usa-GNU-Linux/2\">Básico</a>.</p>",
                "url": "/blog/Usa-GNU-Linux/1",
                
                
                "categories": ["GNU-Linux"],                
                
                "date_published": "2021-08-07T00:00:00+00:00",
                "date_modified": "2021-08-07T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            },
        
            {
                "title": "¿Un blog?",
                "content_text": "Este es mi post de introducción, intentare responder algunas preguntas que puedes tener apartir de la existencia de este blog.¿Por qué un blog?Pense en como podría tener mis notas o mini-tutoriales, tenerlas en github puede ser útil pero no es fácil compartirlo además de que ahí no lo documento en español por lo que si quiero dirigir a alguíen a mi documentación, el tema del lenguaje lo puede complicar por lo que llegué a la conclusión de que lo mejor será realizar post esporadicamente en este medio.  El blog entero se encontrará en español, sin embargo, algunas notas pueden contener frases en inglés por las tecnologías que se ocupan.¿Qué tan seguído se publicarán post nuevos?Realmente no existirá un calendario, principalmente son notas, sin embargo, intentaré al menos publicar sobre algo interesante una vez al mes.¿Sobre qué serán los posts?Mayormente sobre tecnología, nueva y no tan nueva, mayormente del estilo no tan abstracto, tecnologías como contenedores en linux, seguridad en servidores, desplegar algún servicio, máquinas virtuales pero si tendré algunas notas sobre lenguajes de programación.",
                "content_html": "<p>Este es mi post de introducción, intentare responder algunas preguntas que puedes tener apartir de la existencia de este blog.</p><h4 id=\"por-qué-un-blog\">¿Por qué un blog?</h4><p>Pense en como podría tener mis notas o mini-tutoriales, tenerlas en github puede ser útil pero no es fácil compartirlo además de que ahí no lo documento en español por lo que si quiero dirigir a alguíen a mi documentación, el tema del lenguaje lo puede complicar por lo que llegué a la conclusión de que lo mejor será realizar post esporadicamente en este medio.</p><blockquote>  <p>El blog entero se encontrará en español, sin embargo, algunas notas pueden contener frases en inglés por las tecnologías que se ocupan.</p></blockquote><h4 id=\"qué-tan-seguído-se-publicarán-post-nuevos\">¿Qué tan seguído se publicarán post nuevos?</h4><p>Realmente no existirá un calendario, principalmente son notas, sin embargo, intentaré al menos publicar sobre algo interesante una vez al mes.</p><h4 id=\"sobre-qué-serán-los-posts\">¿Sobre qué serán los posts?</h4><p>Mayormente sobre tecnología, nueva y no tan nueva, mayormente del estilo no tan abstracto, tecnologías como contenedores en linux, seguridad en servidores, desplegar algún servicio, máquinas virtuales pero si tendré algunas notas sobre lenguajes de programación.</p>",
                "url": "/blog/posts/personal/2021/08/07/Intro/",
                
                
                "categories": ["personal"],                
                
                "date_published": "2021-08-07T00:00:00+00:00",
                "date_modified": "2021-08-07T00:00:00+00:00",
                
                "author":  "ksobrenatural" 
                
            }
        
    ],
    "pages": [
            
            {
                "id": "404",
                "title": 404,
                "content_text": "## Página no disponible :(La página a la que intentas acceder no existe o no está disponible.> Go [back]({{site.baseurl}}/)",
                "content_html": "## Página no disponible :(La página a la que intentas acceder no existe o no está disponible.> Go [back]({{site.baseurl}}/)",
                "url": "/blog/404.html",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "usa gnu/linux",
                "title": "Usa GNU/Linux",
                "content_text": "Primero que nada, gracias por tomarte el tiempo de leer esto, la razón de esta guía es para tener un lugar a donde dirigir a amigos y familiares a los que quiero introducir al mundo de GNU/Linux y el software libre, darles a entender que en realidad no es necesario un gran conocimiento en computadoras, simplemente tener ganas de aprender. No importa si estás aquí porque estás cansado de Windows, su lentitud, sus problemas de privacidad, sus pantallas azules o sus actualizaciones en el peor momento, incluso por curiosidad propia, cualquier sea el caso, espero que esta guía te sirva de ayuda :)### Como navegar en esta guía ###Está dividida de acuerdo a un pequeño nivel de dificultad:0. [Instalación]({{site.baseurl}}/Usa-GNU-Linux/1) : Instalación de una distribución GNU/Linux.1. [Básico]({{site.baseurl}}/Usa-GNU-Linux/2) : Entendamos lo básico linux.2. [Software]({{site.baseurl}}/Usa-GNU-Linux/3) : Mantenimiento e instalación de software.3. [Extras]({{site.baseurl}}/Usa-GNU-Linux/4) : ¿Qué más puedo hacer?Esta guía puede ampliarse en algún momento, pero es recomendable investigar por tu cuenta._No tengas miedo de investigar ;)_### Ventajas del software libre ###Llevar a cabo el cambio tiene sus ventajas,* **Gratis:** no necesitas dar nada a cambio de usarlo, pero si te gusta y te gustaría apoyar, siempre puedes donar.* **Privacidad:** no cuenta con telemetría o alguna forma de recolectar tu información.* **Seguridad:** al ser de código abierto hay muchos ojos en el código, si existe un error es fácil y rápido que lo detecten y sea corregido.* **No hay virus:** por la naturaleza de Unix y el software libre es casi imposible tener virus, los sistemas más seguros como servidores o sistemas operativos basados en la red Tor como [tails](https://tails.boum.org/) tienen como base GNU/Linux.* **Conocimiento y control:** Puedes aprender y controlar absolutamente todo, si quieres puedes desactivar algún componente, cambiar el aspecto o forma de trabajar, se puede hacer básicamente todo.* **Libertad:** No te detienen ningunos términos de uso, puedes hacer lo que desees con tu computadora.#### Notas ####A lo largo de la guía llamaré linux para abreviar, pero lo correcto es llamarlo GNU/Linux pues el sistema operativo se compone tanto de las herramientas de GNU como el kernel Linux.Si encuentras un fallo ortográfico, de redacción, técnico o en general cualquier fallo, por favor, házmelo notar, si tienes cuenta de github abre un issue, de lo contrario mándame un mensaje, lo agradeceré mucho :)",
                "content_html": "Primero que nada, gracias por tomarte el tiempo de leer esto, la razón de esta guía es para tener un lugar a donde dirigir a amigos y familiares a los que quiero introducir al mundo de GNU/Linux y el software libre, darles a entender que en realidad no es necesario un gran conocimiento en computadoras, simplemente tener ganas de aprender. No importa si estás aquí porque estás cansado de Windows, su lentitud, sus problemas de privacidad, sus pantallas azules o sus actualizaciones en el peor momento, incluso por curiosidad propia, cualquier sea el caso, espero que esta guía te sirva de ayuda :)### Como navegar en esta guía ###Está dividida de acuerdo a un pequeño nivel de dificultad:0. [Instalación]({{site.baseurl}}/Usa-GNU-Linux/1) : Instalación de una distribución GNU/Linux.1. [Básico]({{site.baseurl}}/Usa-GNU-Linux/2) : Entendamos lo básico linux.2. [Software]({{site.baseurl}}/Usa-GNU-Linux/3) : Mantenimiento e instalación de software.3. [Extras]({{site.baseurl}}/Usa-GNU-Linux/4) : ¿Qué más puedo hacer?Esta guía puede ampliarse en algún momento, pero es recomendable investigar por tu cuenta._No tengas miedo de investigar ;)_### Ventajas del software libre ###Llevar a cabo el cambio tiene sus ventajas,* **Gratis:** no necesitas dar nada a cambio de usarlo, pero si te gusta y te gustaría apoyar, siempre puedes donar.* **Privacidad:** no cuenta con telemetría o alguna forma de recolectar tu información.* **Seguridad:** al ser de código abierto hay muchos ojos en el código, si existe un error es fácil y rápido que lo detecten y sea corregido.* **No hay virus:** por la naturaleza de Unix y el software libre es casi imposible tener virus, los sistemas más seguros como servidores o sistemas operativos basados en la red Tor como [tails](https://tails.boum.org/) tienen como base GNU/Linux.* **Conocimiento y control:** Puedes aprender y controlar absolutamente todo, si quieres puedes desactivar algún componente, cambiar el aspecto o forma de trabajar, se puede hacer básicamente todo.* **Libertad:** No te detienen ningunos términos de uso, puedes hacer lo que desees con tu computadora.#### Notas ####A lo largo de la guía llamaré linux para abreviar, pero lo correcto es llamarlo GNU/Linux pues el sistema operativo se compone tanto de las herramientas de GNU como el kernel Linux.Si encuentras un fallo ortográfico, de redacción, técnico o en general cualquier fallo, por favor, házmelo notar, si tienes cuenta de github abre un issue, de lo contrario mándame un mensaje, lo agradeceré mucho :)",
                "url": "/blog/Usa-GNU-Linux/",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "ksobrenatural",
                "title": "ksobrenatural",
                "content_text": "Hola, soy ksobrenatural de México.Me interesan muchas cosas en la vida, algunas de ellas son:- El uso, aprendizaje y promoción del software libre.- Ver películas y series, no todas son buenas, pero por lo menos son algo entretenidas. Una de mis series favoritas es sobrenatural, de ahí mi username.- Aprender sobre tecnologías como Bash, C, Python, Contenedores en Linux.- Experimentar con sistemas operativos.Puedes contactarme por medio de mi correo electrónico o por medio de telegram.Si deseas hacer una donación económica, aquí se encuentra mi monedero de la criptomoneda, Monero.[Mi Github](https://github.com/ksobrenat32)[Mi Correo](mailto:ksobrenatural.7r4ty@8shield.net)",
                "content_html": "Hola, soy ksobrenatural de México.Me interesan muchas cosas en la vida, algunas de ellas son:- El uso, aprendizaje y promoción del software libre.- Ver películas y series, no todas son buenas, pero por lo menos son algo entretenidas. Una de mis series favoritas es sobrenatural, de ahí mi username.- Aprender sobre tecnologías como Bash, C, Python, Contenedores en Linux.- Experimentar con sistemas operativos.Puedes contactarme por medio de mi correo electrónico o por medio de telegram.Si deseas hacer una donación económica, aquí se encuentra mi monedero de la criptomoneda, Monero.<img src=\"https://github.com/ksobrenat32/ksobrenat32/blob/main/monero.png?raw=true\" alt=\"drawing\" width=\"150\"/>[Mi Github](https://github.com/ksobrenat32)[Mi Correo](mailto:ksobrenatural.7r4ty@8shield.net)",
                "url": "/blog/about.html",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "",
                "title": null,
                "content_text": "{    \"website_title\": \"{{ site.title | xml_escape }}\",    \"website_url\": \"{{ \"/\" | absolute_url }}\",    \"posts\": [        {% for post in site.posts %}            {                \"title\": {{ post.title | jsonify }},                \"content_text\": {{ post.content | strip_html | strip_newlines | jsonify }},                \"content_html\": {{ post.content | strip_newlines | jsonify }},                \"url\": \"{{ post.url | absolute_url }}\",                {% if post.image.size > 0 %}                \"image\": {{ post.image | jsonify }},{% endif %}                {% if post.categories.size > 0 %}                \"categories\": {{ post.categories | jsonify }},{% endif %}                                {% if post.tags.size > 0 %}                \"tags\": {{ post.tags | jsonify }},{% endif %}                \"date_published\": \"{{ post.date | date_to_xmlschema }}\",                \"date_modified\": \"{{ post.date | date_to_xmlschema }}\",                {% if post.author %}                \"author\": {% if post.author.name %} \"{{ post.author.name }}\" {% else %} \"{{ post.author }}\" {% endif %}                {% else %}                \"author\": {% if site.author.name %} \"{{ site.author.name }}\" {% else %} \"{{ site.author }}\" {% endif %}                {% endif %}            }{% if forloop.last == false %},{% endif %}        {% endfor %}    ],    \"pages\": [            {% for page in site.pages %}            {                \"id\": {{page.title | downcase | jsonify}},                \"title\": {{ page.title | jsonify }},                \"content_text\": {{ page.content | strip_html | strip_newlines | jsonify }},                \"content_html\": {{ page.content | strip_newlines | jsonify }},                \"url\": \"{{ page.url | absolute_url }}\",                \"date_published\": \"{{ page.date | date_to_xmlschema }}\",                \"date_modified\": \"{{ page.date | date_to_xmlschema }}\"            }{% if forloop.last == false %},{% endif %}        {% endfor %}    ]           }",
                "content_html": "{    \"website_title\": \"{{ site.title | xml_escape }}\",    \"website_url\": \"{{ \"/\" | absolute_url }}\",    \"posts\": [        {% for post in site.posts %}            {                \"title\": {{ post.title | jsonify }},                \"content_text\": {{ post.content | strip_html | strip_newlines | jsonify }},                \"content_html\": {{ post.content | strip_newlines | jsonify }},                \"url\": \"{{ post.url | absolute_url }}\",                {% if post.image.size > 0 %}                \"image\": {{ post.image | jsonify }},{% endif %}                {% if post.categories.size > 0 %}                \"categories\": {{ post.categories | jsonify }},{% endif %}                                {% if post.tags.size > 0 %}                \"tags\": {{ post.tags | jsonify }},{% endif %}                \"date_published\": \"{{ post.date | date_to_xmlschema }}\",                \"date_modified\": \"{{ post.date | date_to_xmlschema }}\",                {% if post.author %}                \"author\": {% if post.author.name %} \"{{ post.author.name }}\" {% else %} \"{{ post.author }}\" {% endif %}                {% else %}                \"author\": {% if site.author.name %} \"{{ site.author.name }}\" {% else %} \"{{ site.author }}\" {% endif %}                {% endif %}            }{% if forloop.last == false %},{% endif %}        {% endfor %}    ],    \"pages\": [            {% for page in site.pages %}            {                \"id\": {{page.title | downcase | jsonify}},                \"title\": {{ page.title | jsonify }},                \"content_text\": {{ page.content | strip_html | strip_newlines | jsonify }},                \"content_html\": {{ page.content | strip_newlines | jsonify }},                \"url\": \"{{ page.url | absolute_url }}\",                \"date_published\": \"{{ page.date | date_to_xmlschema }}\",                \"date_modified\": \"{{ page.date | date_to_xmlschema }}\"            }{% if forloop.last == false %},{% endif %}        {% endfor %}    ]           }",
                "url": "/blog/api.json",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "blog",
                "title": "Blog",
                "content_text": "{% for post in site.posts %}{% if post.visible==1 %}{{post.title}}{%- endif -%}{%endfor%}",
                "content_html": "{% for post in site.posts %}{% if post.visible==1 %}<a href=\"{{site.baseurl}}{{post.url}}\">{{post.title}}</a>{%- endif -%}{%endfor%}",
                "url": "/blog/",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "",
                "title": null,
                "content_text": "{% if page.xsl %}{% endif %}{% assign collections = site.collections | where_exp:'collection','collection.output != false' %}{% for collection in collections %}{% assign docs = collection.docs | where_exp:'doc','doc.sitemap != false' %}{% for doc in docs %}{{ doc.url | replace:'/index.html','/' | absolute_url | xml_escape }}{% if doc.last_modified_at or doc.date %}{{ doc.last_modified_at | default: doc.date | date_to_xmlschema }}{% endif %}{% endfor %}{% endfor %}{% assign pages = site.html_pages | where_exp:'doc','doc.sitemap != false' | where_exp:'doc','doc.url != \"/404.html\"' %}{% for page in pages %}{{ page.url | replace:'/index.html','/' | absolute_url | xml_escape }}{% if page.last_modified_at %}{{ page.last_modified_at | date_to_xmlschema }}{% endif %}{% endfor %}{% assign static_files = page.static_files | where_exp:'page','page.sitemap != false' | where_exp:'page','page.name != \"404.html\"' %}{% for file in static_files %}{{ file.path | replace:'/index.html','/' | absolute_url | xml_escape }}{{ file.modified_time | date_to_xmlschema }}{% endfor %}",
                "content_html": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>{% if page.xsl %}<?xml-stylesheet type=\"text/xsl\" href=\"{{ \"/sitemap.xsl\" | absolute_url }}\"?>{% endif %}<urlset xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://www.sitemaps.org/schemas/sitemap/0.9 http://www.sitemaps.org/schemas/sitemap/0.9/sitemap.xsd\" xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\">{% assign collections = site.collections | where_exp:'collection','collection.output != false' %}{% for collection in collections %}{% assign docs = collection.docs | where_exp:'doc','doc.sitemap != false' %}{% for doc in docs %}<url><loc>{{ doc.url | replace:'/index.html','/' | absolute_url | xml_escape }}</loc>{% if doc.last_modified_at or doc.date %}<lastmod>{{ doc.last_modified_at | default: doc.date | date_to_xmlschema }}</lastmod>{% endif %}</url>{% endfor %}{% endfor %}{% assign pages = site.html_pages | where_exp:'doc','doc.sitemap != false' | where_exp:'doc','doc.url != \"/404.html\"' %}{% for page in pages %}<url><loc>{{ page.url | replace:'/index.html','/' | absolute_url | xml_escape }}</loc>{% if page.last_modified_at %}<lastmod>{{ page.last_modified_at | date_to_xmlschema }}</lastmod>{% endif %}</url>{% endfor %}{% assign static_files = page.static_files | where_exp:'page','page.sitemap != false' | where_exp:'page','page.name != \"404.html\"' %}{% for file in static_files %}<url><loc>{{ file.path | replace:'/index.html','/' | absolute_url | xml_escape }}</loc><lastmod>{{ file.modified_time | date_to_xmlschema }}</lastmod></url>{% endfor %}</urlset>",
                "url": "/blog/sitemap.xml",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "",
                "title": null,
                "content_text": "Sitemap: {{ \"sitemap.xml\" | absolute_url }}",
                "content_html": "Sitemap: {{ \"sitemap.xml\" | absolute_url }}",
                "url": "/blog/robots.txt",
                "date_published": "",
                "date_modified": ""
            },
        
            {
                "id": "",
                "title": null,
                "content_text": "{% if page.xsl %}{% endif %}Jekyll{{ site.time | date_to_xmlschema }}{{ page.url | absolute_url | xml_escape }}{% assign title = site.title | default: site.name %}{% if page.collection != \"posts\" %}{% assign collection = page.collection | capitalize %}{% assign title = title | append: \" | \" | append: collection %}{% endif %}{% if page.category %}{% assign category = page.category | capitalize %}{% assign title = title | append: \" | \" | append: category %}{% endif %}{% if title %}{{ title | smartify | xml_escape }}{% endif %}{% if site.description %}{{ site.description | xml_escape }}{% endif %}{% if site.author %}{{ site.author.name | default: site.author | xml_escape }}{% if site.author.email %}{{ site.author.email | xml_escape }}{% endif %}{% if site.author.uri %}{{ site.author.uri | xml_escape }}{% endif %}{% endif %}{% assign posts = site[page.collection] | where_exp: \"post\", \"post.draft != true\" | sort: \"date\" | reverse %}{% if page.category %}{% assign posts = posts | where: \"category\",page.category %}{% endif %}{% for post in posts limit: 10 %}{{ post.title | smartify | strip_html | normalize_whitespace | xml_escape }}{{ post.date | date_to_xmlschema }}{{ post.last_modified_at | default: post.date | date_to_xmlschema }}{{ post.id | absolute_url | xml_escape }}{% assign excerpt_only = post.feed.excerpt_only | default: site.feed.excerpt_only %}{% unless excerpt_only %}{{ post.content | strip | xml_escape }}{% endunless %}{% assign post_author = post.author | default: post.authors[0] | default: site.author %}{% assign post_author = site.data.authors[post_author] | default: post_author %}{% assign post_author_email = post_author.email | default: nil %}{% assign post_author_uri = post_author.uri | default: nil %}{% assign post_author_name = post_author.name | default: post_author %}{{ post_author_name | default: \"\" | xml_escape }}{% if post_author_email %}{{ post_author_email | xml_escape }}{% endif %}{% if post_author_uri %}{{ post_author_uri | xml_escape }}{% endif %}{% if post.category %}{% endif %}{% for tag in post.tags %}{% endfor %}{% if post.excerpt and post.excerpt != empty %}{{ post.excerpt | strip_html | normalize_whitespace | xml_escape }}{% endif %}{% assign post_image = post.image.path | default: post.image %}{% if post_image %}{% unless post_image contains \"://\" %}{% assign post_image = post_image | absolute_url %}{% endunless %}{% endif %}{% endfor %}",
                "content_html": "<?xml version=\"1.0\" encoding=\"utf-8\"?>{% if page.xsl %}<?xml-stylesheet type=\"text/xml\" href=\"{{ '/feed.xslt.xml' | absolute_url }}\"?>{% endif %}<feed xmlns=\"http://www.w3.org/2005/Atom\" {% if site.lang %}xml:lang=\"{{ site.lang }}\"{% endif %}><generator uri=\"https://jekyllrb.com/\" version=\"{{ jekyll.version }}\">Jekyll</generator><link href=\"{{ page.url | absolute_url }}\" rel=\"self\" type=\"application/atom+xml\" /><link href=\"{{ '/' | absolute_url }}\" rel=\"alternate\" type=\"text/html\" {% if site.lang %}hreflang=\"{{ site.lang }}\" {% endif %}/><updated>{{ site.time | date_to_xmlschema }}</updated><id>{{ page.url | absolute_url | xml_escape }}</id>{% assign title = site.title | default: site.name %}{% if page.collection != \"posts\" %}{% assign collection = page.collection | capitalize %}{% assign title = title | append: \" | \" | append: collection %}{% endif %}{% if page.category %}{% assign category = page.category | capitalize %}{% assign title = title | append: \" | \" | append: category %}{% endif %}{% if title %}<title type=\"html\">{{ title | smartify | xml_escape }}</title>{% endif %}{% if site.description %}<subtitle>{{ site.description | xml_escape }}</subtitle>{% endif %}{% if site.author %}<author><name>{{ site.author.name | default: site.author | xml_escape }}</name>{% if site.author.email %}<email>{{ site.author.email | xml_escape }}</email>{% endif %}{% if site.author.uri %}<uri>{{ site.author.uri | xml_escape }}</uri>{% endif %}</author>{% endif %}{% assign posts = site[page.collection] | where_exp: \"post\", \"post.draft != true\" | sort: \"date\" | reverse %}{% if page.category %}{% assign posts = posts | where: \"category\",page.category %}{% endif %}{% for post in posts limit: 10 %}<entry{% if post.lang %}{{\" \"}}xml:lang=\"{{ post.lang }}\"{% endif %}><title type=\"html\">{{ post.title | smartify | strip_html | normalize_whitespace | xml_escape }}</title><link href=\"{{ post.url | absolute_url }}\" rel=\"alternate\" type=\"text/html\" title=\"{{ post.title | xml_escape }}\" /><published>{{ post.date | date_to_xmlschema }}</published><updated>{{ post.last_modified_at | default: post.date | date_to_xmlschema }}</updated><id>{{ post.id | absolute_url | xml_escape }}</id>{% assign excerpt_only = post.feed.excerpt_only | default: site.feed.excerpt_only %}{% unless excerpt_only %}<content type=\"html\" xml:base=\"{{ post.url | absolute_url | xml_escape }}\">{{ post.content | strip | xml_escape }}</content>{% endunless %}{% assign post_author = post.author | default: post.authors[0] | default: site.author %}{% assign post_author = site.data.authors[post_author] | default: post_author %}{% assign post_author_email = post_author.email | default: nil %}{% assign post_author_uri = post_author.uri | default: nil %}{% assign post_author_name = post_author.name | default: post_author %}<author><name>{{ post_author_name | default: \"\" | xml_escape }}</name>{% if post_author_email %}<email>{{ post_author_email | xml_escape }}</email>{% endif %}{% if post_author_uri %}<uri>{{ post_author_uri | xml_escape }}</uri>{% endif %}</author>{% if post.category %}<category term=\"{{ post.category | xml_escape }}\" />{% endif %}{% for tag in post.tags %}<category term=\"{{ tag | xml_escape }}\" />{% endfor %}{% if post.excerpt and post.excerpt != empty %}<summary type=\"html\">{{ post.excerpt | strip_html | normalize_whitespace | xml_escape }}</summary>{% endif %}{% assign post_image = post.image.path | default: post.image %}{% if post_image %}{% unless post_image contains \"://\" %}{% assign post_image = post_image | absolute_url %}{% endunless %}<media:thumbnail xmlns:media=\"http://search.yahoo.com/mrss/\" url=\"{{ post_image | xml_escape }}\" /><media:content medium=\"image\" url=\"{{ post_image | xml_escape }}\" xmlns:media=\"http://search.yahoo.com/mrss/\" />{% endif %}</entry>{% endfor %}</feed>",
                "url": "/blog/feed.xml",
                "date_published": "",
                "date_modified": ""
            }
        
    ]           
}